nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_flexio.h
/*
** ###################################################################
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    KL43P64M48SF6RM, Rev.3, Aug 2014
**     Version:             rev. 1.3, 2014-08-21
**     Build:               b140821
**
**     Abstract:
**         Extension to the CMSIS register access layer header.
**
**     Copyright (c) 2014 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2014-03-27)
**         Initial version.
**     - rev. 1.1 (2014-05-26)
**         I2S registers TCR2/RCR2 and others were changed.
**         FLEXIO register FLEXIO_VERID has now bitfields: FEATURE, MINOR, MAJOR.
**         Names of the bitfields of the FLEXIO_SHIFTBUF have been changed to the appropriate register name e.g.: FLEXIO_SHIFTBUFBBS_SHIFTBUFBBS.
**         Peripheral_BASES macros has been changed to Peripheral_BASE_PTRS, e.g.: ADC_BASES to ADC_BASE_PTRS.
**         Clock configuration for high range external oscillator has been added.
**         RFSYS module access has been added.
**     - rev. 1.2 (2014-07-10)
**         GPIO - Renamed modules PTA,PTB,PTC,PTD,PTE to GPIOA,GPIOB,GPIOC,GPIOD,GPIOE.
**         UART0 - UART0 module renamed to UART2.
**         I2S - removed MDR register.
**     - rev. 1.3 (2014-08-21)
**         UART2 - Removed ED register.
**         UART2 - Removed MODEM register.
**         UART2 - Removed IR register.
**         UART2 - Removed PFIFO register.
**         UART2 - Removed CFIFO register.
**         UART2 - Removed SFIFO register.
**         UART2 - Removed TWFIFO register.
**         UART2 - Removed TCFIFO register.
**         UART2 - Removed RWFIFO register.
**         UART2 - Removed RCFIFO register.
**         USB - Removed bitfield REG_EN in CLK_RECOVER_IRC_EN register.
**         SIM - Changed bitfield value MCGIRCLK to LIRC_CLK of bitfield CLKOUTSEL in SOPT2 register.
**         SIM - Removed bitfield DIEID in SDID register.
**
** ###################################################################
*/

/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __HW_FLEXIO_REGISTERS_H__
#define __HW_FLEXIO_REGISTERS_H__

#include "MKL43Z4.h"
#include "fsl_bitaccess.h"

/*
 * MKL43Z4 FLEXIO
 *
 * The FLEXIO Memory Map/Register Definition can be found here.
 *
 * Registers defined in this header file:
 * - HW_FLEXIO_VERID - Version ID Register
 * - HW_FLEXIO_PARAM - Parameter Register
 * - HW_FLEXIO_CTRL - FlexIO Control Register
 * - HW_FLEXIO_SHIFTSTAT - Shifter Status Register
 * - HW_FLEXIO_SHIFTERR - Shifter Error Register
 * - HW_FLEXIO_TIMSTAT - Timer Status Register
 * - HW_FLEXIO_SHIFTSIEN - Shifter Status Interrupt Enable
 * - HW_FLEXIO_SHIFTEIEN - Shifter Error Interrupt Enable
 * - HW_FLEXIO_TIMIEN - Timer Interrupt Enable Register
 * - HW_FLEXIO_SHIFTSDEN - Shifter Status DMA Enable
 * - HW_FLEXIO_SHIFTCTLn - Shifter Control N Register
 * - HW_FLEXIO_SHIFTCFGn - Shifter Configuration N Register
 * - HW_FLEXIO_SHIFTBUFn - Shifter Buffer N Register
 * - HW_FLEXIO_SHIFTBUFBBSn - Shifter Buffer N Bit Byte Swapped Register
 * - HW_FLEXIO_SHIFTBUFBYSn - Shifter Buffer N Byte Swapped Register
 * - HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register
 * - HW_FLEXIO_TIMCTLn - Timer Control N Register
 * - HW_FLEXIO_TIMCFGn - Timer Configuration N Register
 * - HW_FLEXIO_TIMCMPn - Timer Compare N Register
 *
 * - hw_flexio_t - Struct containing all module registers.
 */

#define HW_FLEXIO_INSTANCE_COUNT (1U) /*!< Number of instances of the FLEXIO module. */

/*******************************************************************************
 * HW_FLEXIO_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 *
 * .
 */
typedef union _hw_flexio_verid
{
    uint32_t U;
    struct _hw_flexio_verid_bitfields
    {
        uint32_t FEATURE : 16;         /*!< [15:0] Feature Specification Number */
        uint32_t MINOR : 8;            /*!< [23:16] Minor Version Number */
        uint32_t MAJOR : 8;            /*!< [31:24] Major Version Number */
    } B;
} hw_flexio_verid_t;

/*!
 * @name Constants and macros for entire FLEXIO_VERID register
 */
/*@{*/
#define HW_FLEXIO_VERID_ADDR(x)  ((x) + 0x0U)

#define HW_FLEXIO_VERID(x)       (*(__I hw_flexio_verid_t *) HW_FLEXIO_VERID_ADDR(x))
#define HW_FLEXIO_VERID_RD(x)    (HW_FLEXIO_VERID(x).U)
/*@}*/

