nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_flexio.h
/*
 * Constants & macros for individual FLEXIO_VERID bitfields
 */

/*!
 * @name Register FLEXIO_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0 - Standard features implemented.
 * - 1 - Supports state, logic and parallel modes.
 */
/*@{*/
#define BP_FLEXIO_VERID_FEATURE (0U)       /*!< Bit position for FLEXIO_VERID_FEATURE. */
#define BM_FLEXIO_VERID_FEATURE (0x0000FFFFU) /*!< Bit mask for FLEXIO_VERID_FEATURE. */
#define BS_FLEXIO_VERID_FEATURE (16U)      /*!< Bit field size in bits for FLEXIO_VERID_FEATURE. */

/*! @brief Read current value of the FLEXIO_VERID_FEATURE field. */
#define BR_FLEXIO_VERID_FEATURE(x) (BME_UBFX32(HW_FLEXIO_VERID_ADDR(x), BP_FLEXIO_VERID_FEATURE, BS_FLEXIO_VERID_FEATURE))
/*@}*/

/*!
 * @name Register FLEXIO_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
#define BP_FLEXIO_VERID_MINOR (16U)        /*!< Bit position for FLEXIO_VERID_MINOR. */
#define BM_FLEXIO_VERID_MINOR (0x00FF0000U) /*!< Bit mask for FLEXIO_VERID_MINOR. */
#define BS_FLEXIO_VERID_MINOR (8U)         /*!< Bit field size in bits for FLEXIO_VERID_MINOR. */

/*! @brief Read current value of the FLEXIO_VERID_MINOR field. */
#define BR_FLEXIO_VERID_MINOR(x) (BME_UBFX32(HW_FLEXIO_VERID_ADDR(x), BP_FLEXIO_VERID_MINOR, BS_FLEXIO_VERID_MINOR))
/*@}*/

/*!
 * @name Register FLEXIO_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
#define BP_FLEXIO_VERID_MAJOR (24U)        /*!< Bit position for FLEXIO_VERID_MAJOR. */
#define BM_FLEXIO_VERID_MAJOR (0xFF000000U) /*!< Bit mask for FLEXIO_VERID_MAJOR. */
#define BS_FLEXIO_VERID_MAJOR (8U)         /*!< Bit field size in bits for FLEXIO_VERID_MAJOR. */

/*! @brief Read current value of the FLEXIO_VERID_MAJOR field. */
#define BR_FLEXIO_VERID_MAJOR(x) (BME_UBFX32(HW_FLEXIO_VERID_ADDR(x), BP_FLEXIO_VERID_MAJOR, BS_FLEXIO_VERID_MAJOR))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x10080404U
 *
 * .
 */
typedef union _hw_flexio_param
{
    uint32_t U;
    struct _hw_flexio_param_bitfields
    {
        uint32_t SHIFTER : 8;          /*!< [7:0] Shifter Number */
        uint32_t TIMER : 8;            /*!< [15:8] Timer Number */
        uint32_t PIN : 8;              /*!< [23:16] Pin Number */
        uint32_t TRIGGER : 8;          /*!< [31:24] Trigger Number */
    } B;
} hw_flexio_param_t;

/*!
 * @name Constants and macros for entire FLEXIO_PARAM register
 */
/*@{*/
#define HW_FLEXIO_PARAM_ADDR(x)  ((x) + 0x4U)

#define HW_FLEXIO_PARAM(x)       (*(__I hw_flexio_param_t *) HW_FLEXIO_PARAM_ADDR(x))
#define HW_FLEXIO_PARAM_RD(x)    (HW_FLEXIO_PARAM(x).U)
/*@}*/

/*
 * Constants & macros for individual FLEXIO_PARAM bitfields
 */

/*!
 * @name Register FLEXIO_PARAM, field SHIFTER[7:0] (RO)
 *
 * Number of Shifters implemented.
 */
/*@{*/
#define BP_FLEXIO_PARAM_SHIFTER (0U)       /*!< Bit position for FLEXIO_PARAM_SHIFTER. */
#define BM_FLEXIO_PARAM_SHIFTER (0x000000FFU) /*!< Bit mask for FLEXIO_PARAM_SHIFTER. */
#define BS_FLEXIO_PARAM_SHIFTER (8U)       /*!< Bit field size in bits for FLEXIO_PARAM_SHIFTER. */

/*! @brief Read current value of the FLEXIO_PARAM_SHIFTER field. */
#define BR_FLEXIO_PARAM_SHIFTER(x) (BME_UBFX32(HW_FLEXIO_PARAM_ADDR(x), BP_FLEXIO_PARAM_SHIFTER, BS_FLEXIO_PARAM_SHIFTER))
/*@}*/

/*!
 * @name Register FLEXIO_PARAM, field TIMER[15:8] (RO)
 *
 * Number of Timers implemented.
 */
/*@{*/
#define BP_FLEXIO_PARAM_TIMER (8U)         /*!< Bit position for FLEXIO_PARAM_TIMER. */
#define BM_FLEXIO_PARAM_TIMER (0x0000FF00U) /*!< Bit mask for FLEXIO_PARAM_TIMER. */
#define BS_FLEXIO_PARAM_TIMER (8U)         /*!< Bit field size in bits for FLEXIO_PARAM_TIMER. */

/*! @brief Read current value of the FLEXIO_PARAM_TIMER field. */
#define BR_FLEXIO_PARAM_TIMER(x) (BME_UBFX32(HW_FLEXIO_PARAM_ADDR(x), BP_FLEXIO_PARAM_TIMER, BS_FLEXIO_PARAM_TIMER))
/*@}*/

/*!
 * @name Register FLEXIO_PARAM, field PIN[23:16] (RO)
 *
 * Number of Pins implemented.
 */
/*@{*/
#define BP_FLEXIO_PARAM_PIN  (16U)         /*!< Bit position for FLEXIO_PARAM_PIN. */
#define BM_FLEXIO_PARAM_PIN  (0x00FF0000U) /*!< Bit mask for FLEXIO_PARAM_PIN. */
#define BS_FLEXIO_PARAM_PIN  (8U)          /*!< Bit field size in bits for FLEXIO_PARAM_PIN. */

/*! @brief Read current value of the FLEXIO_PARAM_PIN field. */
#define BR_FLEXIO_PARAM_PIN(x) (BME_UBFX32(HW_FLEXIO_PARAM_ADDR(x), BP_FLEXIO_PARAM_PIN, BS_FLEXIO_PARAM_PIN))
/*@}*/

/*!
 * @name Register FLEXIO_PARAM, field TRIGGER[31:24] (RO)
 *
 * Number of external triggers implemented.
 */
/*@{*/
#define BP_FLEXIO_PARAM_TRIGGER (24U)      /*!< Bit position for FLEXIO_PARAM_TRIGGER. */
#define BM_FLEXIO_PARAM_TRIGGER (0xFF000000U) /*!< Bit mask for FLEXIO_PARAM_TRIGGER. */
#define BS_FLEXIO_PARAM_TRIGGER (8U)       /*!< Bit field size in bits for FLEXIO_PARAM_TRIGGER. */

/*! @brief Read current value of the FLEXIO_PARAM_TRIGGER field. */
#define BR_FLEXIO_PARAM_TRIGGER(x) (BME_UBFX32(HW_FLEXIO_PARAM_ADDR(x), BP_FLEXIO_PARAM_TRIGGER, BS_FLEXIO_PARAM_TRIGGER))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_CTRL - FlexIO Control Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_CTRL - FlexIO Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_ctrl
{
    uint32_t U;
    struct _hw_flexio_ctrl_bitfields
    {
        uint32_t FLEXEN : 1;           /*!< [0] FlexIO Enable */
        uint32_t SWRST : 1;            /*!< [1] Software Reset */
        uint32_t FASTACC : 1;          /*!< [2] Fast Access */
        uint32_t RESERVED0 : 27;       /*!< [29:3]  */
        uint32_t DBGE : 1;             /*!< [30] Debug Enable */
        uint32_t DOZEN : 1;            /*!< [31] Doze Enable */
    } B;
} hw_flexio_ctrl_t;

/*!
 * @name Constants and macros for entire FLEXIO_CTRL register
 */
/*@{*/
#define HW_FLEXIO_CTRL_ADDR(x)   ((x) + 0x8U)

#define HW_FLEXIO_CTRL(x)        (*(__IO hw_flexio_ctrl_t *) HW_FLEXIO_CTRL_ADDR(x))
#define HW_FLEXIO_CTRL_RD(x)     (HW_FLEXIO_CTRL(x).U)
#define HW_FLEXIO_CTRL_WR(x, v)  (HW_FLEXIO_CTRL(x).U = (v))
#define HW_FLEXIO_CTRL_SET(x, v) (BME_OR32(HW_FLEXIO_CTRL_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_CTRL_CLR(x, v) (BME_AND32(HW_FLEXIO_CTRL_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_CTRL_TOG(x, v) (BME_XOR32(HW_FLEXIO_CTRL_ADDR(x), (uint32_t)(v)))
/*@}*/

