nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_flexio.h
/*
 * Constants & macros for individual FLEXIO_CTRL bitfields
 */

/*!
 * @name Register FLEXIO_CTRL, field FLEXEN[0] (RW)
 *
 * Values:
 * - 0 - FlexIO module is disabled.
 * - 1 - FlexIO module is enabled.
 */
/*@{*/
#define BP_FLEXIO_CTRL_FLEXEN (0U)         /*!< Bit position for FLEXIO_CTRL_FLEXEN. */
#define BM_FLEXIO_CTRL_FLEXEN (0x00000001U) /*!< Bit mask for FLEXIO_CTRL_FLEXEN. */
#define BS_FLEXIO_CTRL_FLEXEN (1U)         /*!< Bit field size in bits for FLEXIO_CTRL_FLEXEN. */

/*! @brief Read current value of the FLEXIO_CTRL_FLEXEN field. */
#define BR_FLEXIO_CTRL_FLEXEN(x) (BME_UBFX32(HW_FLEXIO_CTRL_ADDR(x), BP_FLEXIO_CTRL_FLEXEN, BS_FLEXIO_CTRL_FLEXEN))

/*! @brief Format value for bitfield FLEXIO_CTRL_FLEXEN. */
#define BF_FLEXIO_CTRL_FLEXEN(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_CTRL_FLEXEN) & BM_FLEXIO_CTRL_FLEXEN)

/*! @brief Set the FLEXEN field to a new value. */
#define BW_FLEXIO_CTRL_FLEXEN(x, v) (BME_BFI32(HW_FLEXIO_CTRL_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_CTRL_FLEXEN), BP_FLEXIO_CTRL_FLEXEN, 1))
/*@}*/

/*!
 * @name Register FLEXIO_CTRL, field SWRST[1] (RW)
 *
 * The FlexIO Control Register is not affected by the software reset, all other
 * logic in the FlexIO is affected by the software reset and register accesses
 * are ignored until this bit is cleared. This register bit will remain set until
 * cleared by software, and the reset has cleared in the FlexIO clock domain.
 *
 * Values:
 * - 0 - Software reset is disabled
 * - 1 - Software reset is enabled, all FlexIO registers except the Control
 *     Register are reset.
 */
/*@{*/
#define BP_FLEXIO_CTRL_SWRST (1U)          /*!< Bit position for FLEXIO_CTRL_SWRST. */
#define BM_FLEXIO_CTRL_SWRST (0x00000002U) /*!< Bit mask for FLEXIO_CTRL_SWRST. */
#define BS_FLEXIO_CTRL_SWRST (1U)          /*!< Bit field size in bits for FLEXIO_CTRL_SWRST. */

/*! @brief Read current value of the FLEXIO_CTRL_SWRST field. */
#define BR_FLEXIO_CTRL_SWRST(x) (BME_UBFX32(HW_FLEXIO_CTRL_ADDR(x), BP_FLEXIO_CTRL_SWRST, BS_FLEXIO_CTRL_SWRST))

/*! @brief Format value for bitfield FLEXIO_CTRL_SWRST. */
#define BF_FLEXIO_CTRL_SWRST(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_CTRL_SWRST) & BM_FLEXIO_CTRL_SWRST)

/*! @brief Set the SWRST field to a new value. */
#define BW_FLEXIO_CTRL_SWRST(x, v) (BME_BFI32(HW_FLEXIO_CTRL_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_CTRL_SWRST), BP_FLEXIO_CTRL_SWRST, 1))
/*@}*/

/*!
 * @name Register FLEXIO_CTRL, field FASTACC[2] (RW)
 *
 * Enables fast register accesses to FlexIO registers, but requires the FlexIO
 * clock to be at least twice the frequency of the bus clock.
 *
 * Values:
 * - 0 - Configures for normal register accesses to FlexIO
 * - 1 - Configures for fast register accesses to FlexIO
 */
/*@{*/
#define BP_FLEXIO_CTRL_FASTACC (2U)        /*!< Bit position for FLEXIO_CTRL_FASTACC. */
#define BM_FLEXIO_CTRL_FASTACC (0x00000004U) /*!< Bit mask for FLEXIO_CTRL_FASTACC. */
#define BS_FLEXIO_CTRL_FASTACC (1U)        /*!< Bit field size in bits for FLEXIO_CTRL_FASTACC. */

/*! @brief Read current value of the FLEXIO_CTRL_FASTACC field. */
#define BR_FLEXIO_CTRL_FASTACC(x) (BME_UBFX32(HW_FLEXIO_CTRL_ADDR(x), BP_FLEXIO_CTRL_FASTACC, BS_FLEXIO_CTRL_FASTACC))

/*! @brief Format value for bitfield FLEXIO_CTRL_FASTACC. */
#define BF_FLEXIO_CTRL_FASTACC(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_CTRL_FASTACC) & BM_FLEXIO_CTRL_FASTACC)

/*! @brief Set the FASTACC field to a new value. */
#define BW_FLEXIO_CTRL_FASTACC(x, v) (BME_BFI32(HW_FLEXIO_CTRL_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_CTRL_FASTACC), BP_FLEXIO_CTRL_FASTACC, 1))
/*@}*/

/*!
 * @name Register FLEXIO_CTRL, field DBGE[30] (RW)
 *
 * Enables FlexIO operation in Debug mode.
 *
 * Values:
 * - 0 - FlexIO is disabled in debug modes.
 * - 1 - FlexIO is enabled in debug modes
 */
/*@{*/
#define BP_FLEXIO_CTRL_DBGE  (30U)         /*!< Bit position for FLEXIO_CTRL_DBGE. */
#define BM_FLEXIO_CTRL_DBGE  (0x40000000U) /*!< Bit mask for FLEXIO_CTRL_DBGE. */
#define BS_FLEXIO_CTRL_DBGE  (1U)          /*!< Bit field size in bits for FLEXIO_CTRL_DBGE. */

/*! @brief Read current value of the FLEXIO_CTRL_DBGE field. */
#define BR_FLEXIO_CTRL_DBGE(x) (BME_UBFX32(HW_FLEXIO_CTRL_ADDR(x), BP_FLEXIO_CTRL_DBGE, BS_FLEXIO_CTRL_DBGE))

/*! @brief Format value for bitfield FLEXIO_CTRL_DBGE. */
#define BF_FLEXIO_CTRL_DBGE(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_CTRL_DBGE) & BM_FLEXIO_CTRL_DBGE)

/*! @brief Set the DBGE field to a new value. */
#define BW_FLEXIO_CTRL_DBGE(x, v) (BME_BFI32(HW_FLEXIO_CTRL_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_CTRL_DBGE), BP_FLEXIO_CTRL_DBGE, 1))
/*@}*/

/*!
 * @name Register FLEXIO_CTRL, field DOZEN[31] (RW)
 *
 * Disables FlexIO operation in Doze modes. This field is ignored and the FlexIO
 * always disabled in low-leakage stop modes.
 *
 * Values:
 * - 0 - FlexIO enabled in Doze modes.
 * - 1 - FlexIO disabled in Doze modes.
 */
/*@{*/
#define BP_FLEXIO_CTRL_DOZEN (31U)         /*!< Bit position for FLEXIO_CTRL_DOZEN. */
#define BM_FLEXIO_CTRL_DOZEN (0x80000000U) /*!< Bit mask for FLEXIO_CTRL_DOZEN. */
#define BS_FLEXIO_CTRL_DOZEN (1U)          /*!< Bit field size in bits for FLEXIO_CTRL_DOZEN. */

/*! @brief Read current value of the FLEXIO_CTRL_DOZEN field. */
#define BR_FLEXIO_CTRL_DOZEN(x) (BME_UBFX32(HW_FLEXIO_CTRL_ADDR(x), BP_FLEXIO_CTRL_DOZEN, BS_FLEXIO_CTRL_DOZEN))

/*! @brief Format value for bitfield FLEXIO_CTRL_DOZEN. */
#define BF_FLEXIO_CTRL_DOZEN(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_CTRL_DOZEN) & BM_FLEXIO_CTRL_DOZEN)

/*! @brief Set the DOZEN field to a new value. */
#define BW_FLEXIO_CTRL_DOZEN(x, v) (BME_BFI32(HW_FLEXIO_CTRL_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_CTRL_DOZEN), BP_FLEXIO_CTRL_DOZEN, 1))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTSTAT - Shifter Status Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTSTAT - Shifter Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftstat
{
    uint32_t U;
    struct _hw_flexio_shiftstat_bitfields
    {
        uint32_t SSF : 4;              /*!< [3:0] Shifter Status Flag */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_shiftstat_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTSTAT register
 */
/*@{*/
#define HW_FLEXIO_SHIFTSTAT_ADDR(x) ((x) + 0x10U)

#define HW_FLEXIO_SHIFTSTAT(x)   (*(__IO hw_flexio_shiftstat_t *) HW_FLEXIO_SHIFTSTAT_ADDR(x))
#define HW_FLEXIO_SHIFTSTAT_RD(x) (HW_FLEXIO_SHIFTSTAT(x).U)
#define HW_FLEXIO_SHIFTSTAT_WR(x, v) (HW_FLEXIO_SHIFTSTAT(x).U = (v))
#define HW_FLEXIO_SHIFTSTAT_SET(x, v) (BME_OR32(HW_FLEXIO_SHIFTSTAT_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTSTAT_CLR(x, v) (BME_AND32(HW_FLEXIO_SHIFTSTAT_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTSTAT_TOG(x, v) (BME_XOR32(HW_FLEXIO_SHIFTSTAT_ADDR(x), (uint32_t)(v)))
/*@}*/

