nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_flexio.h
/*******************************************************************************
 * HW_FLEXIO_TIMIEN - Timer Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMIEN - Timer Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timien
{
    uint32_t U;
    struct _hw_flexio_timien_bitfields
    {
        uint32_t TEIE : 4;             /*!< [3:0] Timer Status Interrupt Enable */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_timien_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMIEN register
 */
/*@{*/
#define HW_FLEXIO_TIMIEN_ADDR(x) ((x) + 0x28U)

#define HW_FLEXIO_TIMIEN(x)      (*(__IO hw_flexio_timien_t *) HW_FLEXIO_TIMIEN_ADDR(x))
#define HW_FLEXIO_TIMIEN_RD(x)   (HW_FLEXIO_TIMIEN(x).U)
#define HW_FLEXIO_TIMIEN_WR(x, v) (HW_FLEXIO_TIMIEN(x).U = (v))
#define HW_FLEXIO_TIMIEN_SET(x, v) (BME_OR32(HW_FLEXIO_TIMIEN_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_TIMIEN_CLR(x, v) (BME_AND32(HW_FLEXIO_TIMIEN_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMIEN_TOG(x, v) (BME_XOR32(HW_FLEXIO_TIMIEN_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMIEN bitfields
 */

/*!
 * @name Register FLEXIO_TIMIEN, field TEIE[3:0] (RW)
 *
 * Enables interrupt generation when corresponding TSF is set.
 *
 * Values:
 * - 0 - Timer Status Flag interrupt is disabled
 * - 1 - Timer Status Flag interrupt is enabled
 */
/*@{*/
#define BP_FLEXIO_TIMIEN_TEIE (0U)         /*!< Bit position for FLEXIO_TIMIEN_TEIE. */
#define BM_FLEXIO_TIMIEN_TEIE (0x0000000FU) /*!< Bit mask for FLEXIO_TIMIEN_TEIE. */
#define BS_FLEXIO_TIMIEN_TEIE (4U)         /*!< Bit field size in bits for FLEXIO_TIMIEN_TEIE. */

/*! @brief Read current value of the FLEXIO_TIMIEN_TEIE field. */
#define BR_FLEXIO_TIMIEN_TEIE(x) (BME_UBFX32(HW_FLEXIO_TIMIEN_ADDR(x), BP_FLEXIO_TIMIEN_TEIE, BS_FLEXIO_TIMIEN_TEIE))

/*! @brief Format value for bitfield FLEXIO_TIMIEN_TEIE. */
#define BF_FLEXIO_TIMIEN_TEIE(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMIEN_TEIE) & BM_FLEXIO_TIMIEN_TEIE)

/*! @brief Set the TEIE field to a new value. */
#define BW_FLEXIO_TIMIEN_TEIE(x, v) (BME_BFI32(HW_FLEXIO_TIMIEN_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_TIMIEN_TEIE), BP_FLEXIO_TIMIEN_TEIE, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTSDEN - Shifter Status DMA Enable
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTSDEN - Shifter Status DMA Enable (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftsden
{
    uint32_t U;
    struct _hw_flexio_shiftsden_bitfields
    {
        uint32_t SSDE : 4;             /*!< [3:0] Shifter Status DMA Enable */
        uint32_t RESERVED0 : 28;       /*!< [31:4]  */
    } B;
} hw_flexio_shiftsden_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTSDEN register
 */
/*@{*/
#define HW_FLEXIO_SHIFTSDEN_ADDR(x) ((x) + 0x30U)

#define HW_FLEXIO_SHIFTSDEN(x)   (*(__IO hw_flexio_shiftsden_t *) HW_FLEXIO_SHIFTSDEN_ADDR(x))
#define HW_FLEXIO_SHIFTSDEN_RD(x) (HW_FLEXIO_SHIFTSDEN(x).U)
#define HW_FLEXIO_SHIFTSDEN_WR(x, v) (HW_FLEXIO_SHIFTSDEN(x).U = (v))
#define HW_FLEXIO_SHIFTSDEN_SET(x, v) (BME_OR32(HW_FLEXIO_SHIFTSDEN_ADDR(x), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTSDEN_CLR(x, v) (BME_AND32(HW_FLEXIO_SHIFTSDEN_ADDR(x), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTSDEN_TOG(x, v) (BME_XOR32(HW_FLEXIO_SHIFTSDEN_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTSDEN bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTSDEN, field SSDE[3:0] (RW)
 *
 * Enables DMA request generation when corresponding SSF is set.
 *
 * Values:
 * - 0 - Shifter Status Flag DMA request is disabled
 * - 1 - Shifter Status Flag DMA request is enabled
 */
/*@{*/
#define BP_FLEXIO_SHIFTSDEN_SSDE (0U)      /*!< Bit position for FLEXIO_SHIFTSDEN_SSDE. */
#define BM_FLEXIO_SHIFTSDEN_SSDE (0x0000000FU) /*!< Bit mask for FLEXIO_SHIFTSDEN_SSDE. */
#define BS_FLEXIO_SHIFTSDEN_SSDE (4U)      /*!< Bit field size in bits for FLEXIO_SHIFTSDEN_SSDE. */

/*! @brief Read current value of the FLEXIO_SHIFTSDEN_SSDE field. */
#define BR_FLEXIO_SHIFTSDEN_SSDE(x) (BME_UBFX32(HW_FLEXIO_SHIFTSDEN_ADDR(x), BP_FLEXIO_SHIFTSDEN_SSDE, BS_FLEXIO_SHIFTSDEN_SSDE))

/*! @brief Format value for bitfield FLEXIO_SHIFTSDEN_SSDE. */
#define BF_FLEXIO_SHIFTSDEN_SSDE(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTSDEN_SSDE) & BM_FLEXIO_SHIFTSDEN_SSDE)

/*! @brief Set the SSDE field to a new value. */
#define BW_FLEXIO_SHIFTSDEN_SSDE(x, v) (BME_BFI32(HW_FLEXIO_SHIFTSDEN_ADDR(x), ((uint32_t)(v) << BP_FLEXIO_SHIFTSDEN_SSDE), BP_FLEXIO_SHIFTSDEN_SSDE, 4))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTCTLn - Shifter Control N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTCTLn - Shifter Control N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftctln
{
    uint32_t U;
    struct _hw_flexio_shiftctln_bitfields
    {
        uint32_t SMOD : 3;             /*!< [2:0] Shifter Mode */
        uint32_t RESERVED0 : 4;        /*!< [6:3]  */
        uint32_t PINPOL : 1;           /*!< [7] Shifter Pin Polarity */
        uint32_t PINSEL : 3;           /*!< [10:8] Shifter Pin Select */
        uint32_t RESERVED1 : 5;        /*!< [15:11]  */
        uint32_t PINCFG : 2;           /*!< [17:16] Shifter Pin Configuration */
        uint32_t RESERVED2 : 5;        /*!< [22:18]  */
        uint32_t TIMPOL : 1;           /*!< [23] Timer Polarity */
        uint32_t TIMSEL : 2;           /*!< [25:24] Timer Select */
        uint32_t RESERVED3 : 6;        /*!< [31:26]  */
    } B;
} hw_flexio_shiftctln_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTCTLn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTCTLn_COUNT (4U)

#define HW_FLEXIO_SHIFTCTLn_ADDR(x, n) ((x) + 0x80U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTCTLn(x, n) (*(__IO hw_flexio_shiftctln_t *) HW_FLEXIO_SHIFTCTLn_ADDR(x, n))
#define HW_FLEXIO_SHIFTCTLn_RD(x, n) (HW_FLEXIO_SHIFTCTLn(x, n).U)
#define HW_FLEXIO_SHIFTCTLn_WR(x, n, v) (HW_FLEXIO_SHIFTCTLn(x, n).U = (v))
#define HW_FLEXIO_SHIFTCTLn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTCTLn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTCTLn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTCTLn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

