nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_flexio.h
/*! @brief Read current value of the FLEXIO_TIMCFGn_TSTOP field. */
#define BR_FLEXIO_TIMCFGn_TSTOP(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TSTOP, BS_FLEXIO_TIMCFGn_TSTOP))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TSTOP. */
#define BF_FLEXIO_TIMCFGn_TSTOP(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTOP) & BM_FLEXIO_TIMCFGn_TSTOP)

/*! @brief Set the TSTOP field to a new value. */
#define BW_FLEXIO_TIMCFGn_TSTOP(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TSTOP), BP_FLEXIO_TIMCFGn_TSTOP, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMENA[10:8] (RW)
 *
 * Configures the condition that causes the Timer to be enabled and start
 * decrementing.
 *
 * Values:
 * - 000 - Timer always enabled
 * - 001 - Timer enabled on Timer N-1 enable
 * - 010 - Timer enabled on Trigger high
 * - 011 - Timer enabled on Trigger high and Pin high
 * - 100 - Timer enabled on Pin rising edge
 * - 101 - Timer enabled on Pin rising edge and Trigger high
 * - 110 - Timer enabled on Trigger rising edge
 * - 111 - Timer enabled on Trigger rising or falling edge
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMENA (8U)      /*!< Bit position for FLEXIO_TIMCFGn_TIMENA. */
#define BM_FLEXIO_TIMCFGn_TIMENA (0x00000700U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMENA. */
#define BS_FLEXIO_TIMCFGn_TIMENA (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMENA. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMENA field. */
#define BR_FLEXIO_TIMCFGn_TIMENA(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMENA, BS_FLEXIO_TIMCFGn_TIMENA))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMENA. */
#define BF_FLEXIO_TIMCFGn_TIMENA(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMENA) & BM_FLEXIO_TIMCFGn_TIMENA)

/*! @brief Set the TIMENA field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMENA(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMENA), BP_FLEXIO_TIMCFGn_TIMENA, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMDIS[14:12] (RW)
 *
 * Configures the condition that causes the Timer to be disabled and stop
 * decrementing.
 *
 * Values:
 * - 000 - Timer never disabled
 * - 001 - Timer disabled on Timer N-1 disable
 * - 010 - Timer disabled on Timer compare
 * - 011 - Timer disabled on Timer compare and Trigger Low
 * - 100 - Timer disabled on Pin rising or falling edge
 * - 101 - Timer disabled on Pin rising or falling edge provided Trigger is high
 * - 110 - Timer disabled on Trigger falling edge
 * - 111 - Reserved
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMDIS (12U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMDIS. */
#define BM_FLEXIO_TIMCFGn_TIMDIS (0x00007000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMDIS. */
#define BS_FLEXIO_TIMCFGn_TIMDIS (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMDIS. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMDIS field. */
#define BR_FLEXIO_TIMCFGn_TIMDIS(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMDIS, BS_FLEXIO_TIMCFGn_TIMDIS))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMDIS. */
#define BF_FLEXIO_TIMCFGn_TIMDIS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDIS) & BM_FLEXIO_TIMCFGn_TIMDIS)

/*! @brief Set the TIMDIS field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMDIS(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMDIS), BP_FLEXIO_TIMCFGn_TIMDIS, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMRST[18:16] (RW)
 *
 * Configures the condition that causes the timer counter (and optionally the
 * timer output) to be reset. In 8-bit counter mode, the timer reset will only
 * reset the lower 8-bits that configure the baud rate. In all other modes, the timer
 * reset will reset the full 16-bits of the counter.
 *
 * Values:
 * - 000 - Timer never reset
 * - 001 - Reserved
 * - 010 - Timer reset on Timer Pin equal to Timer Output
 * - 011 - Timer reset on Timer Trigger equal to Timer Output
 * - 100 - Timer reset on Timer Pin rising edge
 * - 101 - Reserved
 * - 110 - Timer reset on Trigger rising edge
 * - 111 - Timer reset on Trigger rising or falling edge
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMRST (16U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMRST. */
#define BM_FLEXIO_TIMCFGn_TIMRST (0x00070000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMRST. */
#define BS_FLEXIO_TIMCFGn_TIMRST (3U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMRST. */

/*! @brief Read current value of the FLEXIO_TIMCFGn_TIMRST field. */
#define BR_FLEXIO_TIMCFGn_TIMRST(x, n) (BME_UBFX32(HW_FLEXIO_TIMCFGn_ADDR(x, n), BP_FLEXIO_TIMCFGn_TIMRST, BS_FLEXIO_TIMCFGn_TIMRST))

/*! @brief Format value for bitfield FLEXIO_TIMCFGn_TIMRST. */
#define BF_FLEXIO_TIMCFGn_TIMRST(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMRST) & BM_FLEXIO_TIMCFGn_TIMRST)

/*! @brief Set the TIMRST field to a new value. */
#define BW_FLEXIO_TIMCFGn_TIMRST(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCFGn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCFGn_TIMRST), BP_FLEXIO_TIMCFGn_TIMRST, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCFGn, field TIMDEC[21:20] (RW)
 *
 * Configures the source of the Timer decrement and the source of the Shift
 * clock.
 *
 * Values:
 * - 00 - Decrement counter on FlexIO clock, Shift clock equals Timer output.
 * - 01 - Decrement counter on Trigger input (both edges), Shift clock equals
 *     Timer output.
 * - 10 - Decrement counter on Pin input (both edges), Shift clock equals Pin
 *     input.
 * - 11 - Decrement counter on Trigger input (both edges), Shift clock equals
 *     Trigger input.
 */
/*@{*/
#define BP_FLEXIO_TIMCFGn_TIMDEC (20U)     /*!< Bit position for FLEXIO_TIMCFGn_TIMDEC. */
#define BM_FLEXIO_TIMCFGn_TIMDEC (0x00300000U) /*!< Bit mask for FLEXIO_TIMCFGn_TIMDEC. */
#define BS_FLEXIO_TIMCFGn_TIMDEC (2U)      /*!< Bit field size in bits for FLEXIO_TIMCFGn_TIMDEC. */

